package exseption.seminar3.zd4;
/*
Задание №4
1. Напишите метод,на вход которогоподаётся двумерный строковый массив
размером 4х4. При подаче массива другого размера необходимо бросить
исключение MyArraySizeException.
2. Далееметод долженпройтисьпо всем элементам массива,преобразоватьв
int и просуммировать. Если в каком-то элементе массива преобразование
не удалось (например, в ячейке лежит символ или текст вместо числа),
должно быть брошено исключение MyArrayDataException с детализацией, в
какой именно ячейкележат неверныеданные.
3. В методе main() вызвать полученный метод, обработать возможные
исключения MyArraySizeException и MyArrayDataException и вывести
результатрасчета (сумму элементов,при условиичто подали на вход
корректныймассив)
 */
public class Main {
}
